app/views/provider_signups/new.html.erb

    <h3>Create a Healthcare Provider Account</h3>
    <%- if ApplicationSettings.load.require_general_invitations %>
---
SELECT  "application_settings".* FROM "application_settings"  ORDER BY "application_settings"."id" DESC LIMIT 1