app/views/shared/_profile.html.erb

SELECT  "providers".* FROM "providers" WHERE "providers"."user_id" = $1 LIMIT 1  [["user_id", 1]]
---
          <% end%>
          <% if @user_profile.provider.present? %>