app/views/shared/_user_profile_fields.html.erb

  <% else %>
    <%= f.simple_fields_for (user_profile.user.emails.last || User::Email.new) do |ff| %>
---
SELECT  "user_emails".* FROM "user_emails" WHERE "user_emails"."user_id" = $1 AND (activated_at is not null and activation_token is null)  ORDER BY "user_emails"."id" DESC LIMIT 1  [["user_id", 1]]