app/controllers/provider_signups_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."private_label" = 'f'  ORDER BY "teams"."launch_date" ASC
---
  def team
    @available_teams = Team.order(launch_date: :asc).all.where(private_label: false)

INSERT INTO "signup_trackers" ("email", "notified_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", ""], ["notified_count", 0], ["created_at", "2019-06-08 10:22:59.744584"], ["updated_at", "2019-06-08 10:22:59.744584"]]
---
  def sign_up_tracker
    signup_track = SignupTracker.create(email: params[:email], status: true, notified_count: 0)

INSERT INTO "providers" ("license_number", "licensing_state", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["license_number", "fdsfdfd"], ["licensing_state", "AK"], ["user_id", 1], ["created_at", "2019-06-08 10:23:29.661022"], ["updated_at", "2019-06-08 10:23:29.661022"]]
SELECT  "signup_trackers".* FROM "signup_trackers" WHERE "signup_trackers"."email" = $1  ORDER BY "signup_trackers"."id" ASC LIMIT 1  [["email", "test.user@inpharmd.com"]]
---
  def create
    @provider_signup = ProviderSignup.new(provider_signup_params)
    @plans = PlanDecorator.decorate_collection(Plan.provider_plans)

    @provider_signup.provider.skip_specialty_validation = request.format.json?
    if @provider_signup.save
      flash.notice = I18n.t('signup.provider.success')
      @provider_signup.queue_welcome_email
      signup_tracker = SignupTracker.where(email: provider_signup_params[:user][:email]).first