app/controllers/sessions_controller.rb

  def destroy
    user = User.where(session[:email]).first
    user.remember_me_token =nil
    user.save!
---
UPDATE "users" SET "last_active_at" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_active_at", "2019-06-08 10:23:55.008111"], ["updated_at", "2019-06-08 10:23:55.009198"], ["id", 1]]